## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/20850437907)



<pre><code>Plan: 1 to import, 15 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository_iam_member.restricted_dev_writers
  * google_artifact_registry_repository_iam_member.restricted_prod_writers
  * google_cloud_identity_group.restricted_registry_dev_read
  * google_cloud_identity_group.restricted_registry_dev_write
  * google_cloud_identity_group.restricted_registry_prod_read
  * google_cloud_identity_group.restricted_registry_prod_write
  * google_secret_manager_secret_iam_member.chainguard_token_artifactregistry_access
  * google_secret_manager_secret_iam_member.chainguard_token_terraform_planner_access
  * module.chainguard_cache.google_artifact_registry_repository.protected_repository[0]
  * module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]
  * module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]
  * module.restricted_dev.google_artifact_registry_repository.protected_repository[0]
  * module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-dev-read@sap.com"]
  * module.restricted_prod.google_artifact_registry_repository.protected_repository[0]
  * module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-prod-read@sap.com"]
* Update
  * google_secret_manager_secret.chainguard_pull_token



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.google_secret_manager_secret_version.chainguard_pull_token_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "chainguard_pull_token_password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + secret       = "chainguard_auth_token"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # google_artifact_registry_repository_iam_member.restricted_dev_writers will be created
  + resource "google_artifact_registry_repository_iam_member" "restricted_dev_writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "group:kyma-restricted-registry-dev-write@sap.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # google_artifact_registry_repository_iam_member.restricted_prod_writers will be created
  + resource "google_artifact_registry_repository_iam_member" "restricted_prod_writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "group:kyma-restricted-registry-prod-write@sap.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # google_cloud_identity_group.restricted_registry_dev_read will be created
  + resource "google_cloud_identity_group" "restricted_registry_dev_read" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-only access to Kyma Restricted Registry DEV environment"
      + display_name          = "Kyma Restricted Registry DEV Read Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-dev-read@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_dev_write will be created
  + resource "google_cloud_identity_group" "restricted_registry_dev_write" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-write access to Kyma Restricted Registry DEV environment"
      + display_name          = "Kyma Restricted Registry DEV Write Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-dev-write@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_prod_read will be created
  + resource "google_cloud_identity_group" "restricted_registry_prod_read" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-only access to Kyma Restricted Registry PROD environment"
      + display_name          = "Kyma Restricted Registry PROD Read Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-prod-read@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_prod_write will be created
  + resource "google_cloud_identity_group" "restricted_registry_prod_write" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-write access to Kyma Restricted Registry PROD environment"
      + display_name          = "Kyma Restricted Registry PROD Write Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-prod-write@sap.com"
        }
    }

  # google_secret_manager_secret.chainguard_pull_token will be updated in-place
  # (imported from "projects/sap-kyma-prow/secrets/chainguard_auth_token")
  ~ resource "google_secret_manager_secret" "chainguard_pull_token" {
        annotations           = {}
        create_time           = "2026-01-09T08:45:22.893734Z"
        effective_annotations = {}
      ~ effective_labels      = {
          + "component" = "restricted-registry"
          + "owner"     = "neighbors"
          + "tool"      = "chainguard"
          + "type"      = "authentication-token"
        }
        id                    = "projects/sap-kyma-prow/secrets/chainguard_auth_token"
      ~ labels                = {
          + "component" = "restricted-registry"
          + "owner"     = "neighbors"
          + "tool"      = "chainguard"
          + "type"      = "authentication-token"
        }
        name                  = "projects/351981214969/secrets/chainguard_auth_token"
        project               = "sap-kyma-prow"
        secret_id             = "chainguard_auth_token"
      ~ terraform_labels      = {
          + "component" = "restricted-registry"
          + "owner"     = "neighbors"
          + "tool"      = "chainguard"
          + "type"      = "authentication-token"
        }
        version_aliases       = {}

        replication {
            auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.chainguard_token_artifactregistry_access will be created
  + resource "google_secret_manager_secret_iam_member" "chainguard_token_artifactregistry_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:service-905162714753@gcp-sa-artifactregistry.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "chainguard_auth_token"
    }

  # google_secret_manager_secret_iam_member.chainguard_token_terraform_planner_access will be created
  + resource "google_secret_manager_secret_iam_member" "chainguard_token_terraform_planner_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "chainguard_auth_token"
    }

  # module.chainguard_cache.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Remote repository for Chainguard pull-through cache"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "chainguard-cache"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "chainguard-cache"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "chainguard-cache"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "chainguard-cache"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + remote_repository_config {
          + description = "Chainguard upstream repository"

          + docker_repository {
              + public_repository = "DOCKER_HUB"

              + custom_repository {
                  + uri = "https://cgr.dev/"
                }
            }

          + upstream_credentials (known after apply)
        }
    }

  # module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Development restricted images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "kyma-restricted-images-dev"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "kyma-restricted-images-dev"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-pr-images"

          + condition {
              + older_than            = "2592000s"
              + package_name_prefixes = []
              + tag_prefixes          = [
                  + "PR-",
                ]
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Production restricted images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "kyma-restricted-images-prod"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "kyma-restricted-images-prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.restricted_dev.data.google_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "this" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.restricted_dev.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Virtual repository for restricted development images"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "restricted-dev"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "VIRTUAL_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "restricted-dev"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + virtual_repository_config {
          + upstream_policies {
              + id         = "kyma-restricted-images-dev"
              + priority   = 100
              + repository = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev"
            }
          + upstream_policies {
              + id         = "chainguard-cache"
              + priority   = 50
              + repository = "projects/kyma-project/locations/europe/repositories/chainguard-cache"
            }
        }
    }

  # module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-dev-read@sap.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "group:kyma-restricted-registry-dev-read@sap.com"
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.restricted_prod.data.google_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "this" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.restricted_prod.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Virtual repository for restricted production images"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "restricted-prod"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "VIRTUAL_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "restricted-prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + virtual_repository_config {
          + upstream_policies {
              + id         = "kyma-restricted-images-prod"
              + priority   = 100
              + repository = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod"
            }
          + upstream_policies {
              + id         = "chainguard-cache"
              + priority   = 50
              + repository = "projects/kyma-project/locations/europe/repositories/chainguard-cache"
            }
        }
    }

  # module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-prod-read@sap.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "group:kyma-restricted-registry-prod-read@sap.com"
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

Plan: 1 to import, 15 to add, 1 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2026-01-07T13:02:23.815749Z" -> "2026-01-09T11:05:08.908887Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules"
        name                   = "dev-kyma-modules"
      ~ update_time            = "2026-01-07T12:40:34.835940Z" -> "2026-01-09T09:47:08.984224Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2026-01-07T13:01:06.392250Z" -> "2026-01-09T11:05:39.753676Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2026-01-07T12:17:29.072703Z" -> "2026-01-09T11:27:55.331904Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kyma_modules.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/kyma-modules"
        name                   = "kyma-modules"
      ~ update_time            = "2026-01-07T09:30:06.174797Z" -> "2026-01-09T09:44:33.079903Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2026-01-07T13:00:54.752001Z" -> "2026-01-09T10:59:27.084784Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13695,"Program":"tfcmt","SHA1":"91c3b980c2f215cd2e7bdbecddb5aaac1aad055b","Vars":{},"WorkflowName":"workflow-controller-pull-requests"} -->